In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("student_performance_2.csv")

In [3]:
df.isnull()

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
6995,False,False,False,False,False,False,False,False
6996,False,False,False,False,False,False,False,False
6997,False,False,False,False,False,False,False,False
6998,False,False,False,False,False,False,False,False
6999,False,False,False,False,False,False,False,False

In [4]:
df.isnull().sum()

Student ID             0
Gender                 0
Age                    0
School                 0
Math Score           358
Reading Score        345
Writing Score        337
Class Performance      0
dtype: int64

In [5]:
df.isnull().sum().sum()

1040

In [6]:
df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [7]:
df['Age'] = df['Age'].astype('float')

In [8]:
df.dtypes

Student ID             int64
Gender                object
Age                  float64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [9]:
df['Age'] = df['Age'].astype('int64')

In [10]:
df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [11]:
df.head()

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,1,Male,18,C,99.0,94.0,98.0,C
1,2,Male,17,D,78.0,61.0,98.0,B
2,3,Female,21,B,67.0,95.0,78.0,A
3,4,Female,20,E,67.0,67.0,86.0,C
4,5,Female,20,B,66.0,81.0,74.0,B

In [12]:
df.tail()

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
6995,6996,Female,17,C,69.0,72.0,80.0,C
6996,6997,Female,21,E,70.0,79.0,100.0,C
6997,6998,Male,21,C,80.0,79.0,78.0,B
6998,6999,Male,20,A,74.0,80.0,68.0,A
6999,7000,Male,18,D,60.0,100.0,81.0,A

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student ID         7000 non-null   int64
 1   Gender             7000 non-null   object
 2   Age                7000 non-null   int64
 3   School             7000 non-null   object
 4   Math Score         6642 non-null   float64
 5   Reading Score      6655 non-null   float64
 6   Writing Score      6663 non-null   float64
 7   Class Performance  7000 non-null   object
dtypes: float64(3), int64(2), object(3)
memory usage: 437.6+ KB

In [14]:
df.shape

(7000, 8)

In [15]:
def min_max_normalize(
    name: str
):
    df[ name ] = (df[ name ] - df[ name ].min()) / ( df[ name ].max() - df[ name ].min() )

In [16]:
df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  6642.000000    6655.000000    6663.000000
mean   3500.500000    19.006286    80.463264      80.598648      80.293862
std    2020.870275     1.411874    13.153499      12.973563      12.746946
min       1.000000    17.000000    60.000000      60.000000      60.000000
25%    1750.750000    18.000000    70.000000      70.000000      70.000000
50%    3500.500000    19.000000    80.000000      80.000000      80.000000
75%    5250.250000    20.000000    91.000000      91.000000      90.000000
max    7000.000000    21.000000   150.000000     150.000000     149.000000

In [17]:
df.shape

(7000, 8)

In [18]:
df.count()

Student ID           7000
Gender               7000
Age                  7000
School               7000
Math Score           6642
Reading Score        6655
Writing Score        6663
Class Performance    7000
dtype: int64

In [19]:
df["Gender"]

0         Male
1         Male
2       Female
3       Female
4       Female
         ...
6995    Female
6996    Female
6997      Male
6998      Male
6999      Male
Name: Gender, Length: 7000, dtype: object

In [20]:
df['Age'].value_counts()

Age
18    1455
21    1425
19    1397
20    1365
17    1358
Name: count, dtype: int64

In [21]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [22]:
def min_max_normalize(
    name: str
):
    df[ name ] = (df[ name ] - df[ name ].min()) / ( df[ name ].max() - df[ name ].min() )

In [23]:
min_max_normalize( "Age" )

In [24]:
df["Age"]

0       0.25
1       0.00
2       1.00
3       0.75
4       0.75
        ...
6995    0.00
6996    1.00
6997    1.00
6998    0.75
6999    0.25
Name: Age, Length: 7000, dtype: float64

In [25]:
df.loc[ df.Gender == "Male" , "Gender" ] = 0
df.loc[ df.Gender == "Female" , "Gender" ] = 1

In [26]:
df["Gender"]

0       0
1       0
2       1
3       1
4       1
       ..
6995    1
6996    1
6997    0
6998    0
6999    0
Name: Gender, Length: 7000, dtype: object

In [27]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df['School'] = label_encoder.fit_transform(df['School'])

In [28]:
df["School"]

0       2
1       3
2       1
3       4
4       1
       ..
6995    2
6996    4
6997    2
6998    0
6999    3
Name: School, Length: 7000, dtype: int32